In [1]:
#Importing dataset and libraries
import pandas as pd
import numpy as np
#training data set
train=pd.read_csv('train_pidilite.csv')
train.head()

,ID,STATE,AGE,OCCUPATION,INCOME_GROUP,CUSTOMER_SINCE,LOYALTY_PROGRAM,PAST_PURCHASE,PURCHASE
0,1,Uttar Pradesh,28,,Low,2018,No,4937,No
1,2,Madhya Pradesh,27,Salaried,Low,2018,No,10834,No
2,3,West Bengal,62,,High,2013,NaN,8610,Yes
3,4,Tamil Nadu,27,Salaried,Low,2018,No,14374,Yes
4,5,Uttar Pradesh,40,Self employed,High,2015,No,13158,No

In [2]:
#test dataset
test=pd.read_csv("test_pdilite.csv")
test.head()

,ID,STATE,AGE,OCCUPATION,INCOME_GROUP,CUSTOMER_SINCE,LOYALTY_PROGRAM,PAST_PURCHASE
0,150001,Maharashtra,50,Self employed,Medium,2018,No,12746
1,150002,Maharashtra,58,Self employed,High,2011,Yes,12277
2,150003,Andaman and Nicobar Islands,30,Salaried,Low,2017,Yes,16401
3,150004,Mizoram,27,Salaried,Low,2018,Yes,9665
4,150005,Uttar Pradesh,67,,Medium,2014,No,15724

In [91]:
#data insights

train['STATE'].describe(),train['STATE'].value_counts()

(count          150000
 unique             34
 top       Maharashtra
 freq            21968
 Name: STATE, dtype: object,
 Maharashtra                    21968
 Tamil Nadu                     17836
 Uttar Pradesh                  16400
 Karnataka                      11689
 Gujarat                         7864
 West Bengal                     7751
 Telangana                       4783
 Andhra Pradesh                  4781
 Rajasthan                       4621
 Kerala                          3718
 Madhya Pradesh                  3680
 Delhi                           3572
 Bihar                           3225
 Haryana                         3197
 Punjab                          3113
 Odisha                          2773
 Assam                           2638
 Chhattisgarh                    2366
 Jharkhand                       2242
 Uttarakhand                     1984
 Jammu and Kashmir               1962
                                 1842
 Himachal Pradesh                1763
 Goa                             1735
 Tripura                         1735
 Chandigarh                      1583
 Puducherry                      1503
 Meghalaya                       1231
 Sikkim                          1200
 Nagaland                        1133
 Manipur                         1108
 Arunachal Pradesh               1065
 Mizoram                          984
 Andaman and Nicobar Islands      955
 Name: STATE, dtype: int64)

In [ ]:
#maximum percentage of customers are from maharashtra (i.e. 14.65%) and about 45% are from Maharashtra,Tamil Nadu,Uttar Pradesh,Karnataka

In [96]:
train['AGE'].describe(),train['AGE'].value_counts()

(count    150000.000000
 mean         43.805660
 std          14.828219
 min          23.000000
 25%          30.000000
 50%          43.000000
 75%          54.000000
 max          85.000000
 Name: AGE, dtype: float64,
 28    8985
 29    8095
 27    7927
 30    6874
 26    5533
       ...
 82     450
 83     408
 84     397
 85     368
 23       1
 Name: AGE, Length: 63, dtype: int64)

In [ ]:
#about 25% of all customers are from age group (23-30)

In [98]:
train['INCOME_GROUP'].describe(),train['INCOME_GROUP'].value_counts()

(count    150000.000000
 mean          0.996160
 std           0.744036
 min           0.000000
 25%           0.000000
 50%           1.000000
 75%           2.000000
 max           2.000000
 Name: INCOME_GROUP, dtype: float64,
 1    66960
 0    41808
 2    41232
 Name: INCOME_GROUP, dtype: int64)

In [ ]:
#medium income group customers are more (i.e. 45%)

In [3]:
#cleaning train dataframe
#calculating null values columns wise
train.isnull().sum(),train.shape

(ID                     0
 STATE                  0
 AGE                    0
 OCCUPATION             0
 INCOME_GROUP           0
 CUSTOMER_SINCE         0
 LOYALTY_PROGRAM    17824
 PAST_PURCHASE          0
 PURCHASE               0
 dtype: int64,
 (150000, 9))

In [4]:
train['LOYALTY_PROGRAM'].value_counts()

No     88182
Yes    43994
Name: LOYALTY_PROGRAM, dtype: int64

In [5]:
#percentage null values in column 'LOYALITY_PROGRAM' is 17824*100/150000=11.88% which is less than 30%, so let's fill these null values by most occuring element.
train['LOYALTY_PROGRAM'].fillna('No',inplace=True)

In [6]:
train.isnull().sum()

ID                 0
STATE              0
AGE                0
OCCUPATION         0
INCOME_GROUP       0
CUSTOMER_SINCE     0
LOYALTY_PROGRAM    0
PAST_PURCHASE      0
PURCHASE           0
dtype: int64

In [7]:
#converting this column LOYALITY_PROGRAM into numerical
train['LOYALTY_PROGRAM']=[0 if train['LOYALTY_PROGRAM'][i]=="No" else 1 for i in train.index]

In [8]:
#Besides null values, there are some blacnk cells in dataframe, lets find them and determining their percentage
train['OCCUPATION'].value_counts()

Self employed    61375
Salaried         44214
                 42777
Business          1634
Name: OCCUPATION, dtype: int64

In [9]:
#the blank values here are more than 10% , so it is eroneous column so let's drop it.
train.drop(['OCCUPATION'],axis=1,inplace=True)

In [10]:
train['INCOME_GROUP'].value_counts()

Low       63523
High      41808
Medium    41232
           3437
Name: INCOME_GROUP, dtype: int64

In [15]:
#the blank values here are less than 10%, so filling it with most occuring one.
train['INCOME_GROUP'].replace(to_replace=" ", value="Low", inplace=True)
train['INCOME_GROUP'].value_counts()

Low       66960
High      41808
Medium    41232
Name: INCOME_GROUP, dtype: int64

In [16]:
test['CUSTOMER_SINCE'].value_counts()
#it is a clean column

2018    14821
2017    12420
2012     4374
2014     3585
2015     3233
2013     3036
2011     2817
2016     2444
2010     1965
2009      938
2019      360
2008        7
Name: CUSTOMER_SINCE, dtype: int64

In [17]:
test['PAST_PURCHASE'].value_counts()
#it is also a clean coumn

40222    23
4841     13
6874     13
9022     13
6359     13
         ..
12873     1
25187     1
21093     1
16999     1
2047      1
Name: PAST_PURCHASE, Length: 19490, dtype: int64

In [19]:
#using label encoder to convert to numerical 
from sklearn.preprocessing import LabelEncoder
number=LabelEncoder()
train['INCOME_GROUP']=number.fit_transform(train['INCOME_GROUP'].astype('str'))

In [20]:
#the train dataframe is fully cleaned now.
train.head()

,ID,STATE,AGE,INCOME_GROUP,CUSTOMER_SINCE,LOYALTY_PROGRAM,PAST_PURCHASE,PURCHASE
0,1,Uttar Pradesh,28,1,2018,0,4937,No
1,2,Madhya Pradesh,27,1,2018,0,10834,No
2,3,West Bengal,62,0,2013,0,8610,Yes
3,4,Tamil Nadu,27,1,2018,0,14374,Yes
4,5,Uttar Pradesh,40,0,2015,0,13158,No

In [21]:
#cleaning test dataframe
#calculating null values columns wise
test.isnull().sum(),test.shape

(ID                    0
 STATE                 0
 AGE                   0
 OCCUPATION            0
 INCOME_GROUP          0
 CUSTOMER_SINCE        0
 LOYALTY_PROGRAM    6004
 PAST_PURCHASE         0
 dtype: int64,
 (50000, 8))

In [22]:
test['LOYALTY_PROGRAM'].value_counts()

No     29290
Yes    14706
Name: LOYALTY_PROGRAM, dtype: int64

In [23]:
#percentage null values in column 'LOYALITY_PROGRAM' is 6004*100/50000=12% which is less than 30%, so let's fill these null values by most occuring element.
test['LOYALTY_PROGRAM'].fillna('No',inplace=True)

In [24]:
test.isnull().sum()

ID                 0
STATE              0
AGE                0
OCCUPATION         0
INCOME_GROUP       0
CUSTOMER_SINCE     0
LOYALTY_PROGRAM    0
PAST_PURCHASE      0
dtype: int64

In [25]:
#converting the 'LOYALITY_PROGRAM' into numerical column
test['LOYALTY_PROGRAM']=[0 if test['LOYALTY_PROGRAM'][i]=="No" else 1 for i in test.index]

In [26]:
#Besides null values, there are some blcnk cells in dataframe, lets find them and determining their percentage
test['OCCUPATION'].value_counts()

Self employed    20603
Salaried         14472
                 14380
Business           545
Name: OCCUPATION, dtype: int64

In [27]:
#the blank values here are more than 10% , so it is eroneous column
test.drop(['OCCUPATION'],axis=1,inplace=True)

In [28]:
test['INCOME_GROUP'].value_counts()

Low       21070
High      14007
Medium    13805
           1118
Name: INCOME_GROUP, dtype: int64

In [29]:
#the blank values here are less than 10%, so filling it with most occuring one.
test['INCOME_GROUP'].replace(to_replace=" ", value="Low", inplace=False)

0        Medium
1          High
2           Low
3           Low
4        Medium
          ...
49995    Medium
49996      High
49997      High
49998       Low
49999       Low
Name: INCOME_GROUP, Length: 50000, dtype: object

In [35]:
#label-encoder
test['INCOME_GROUP']=number.fit_transform(test['INCOME_GROUP'].astype('str'))

In [31]:
test['CUSTOMER_SINCE'].value_counts()
#it is a clean column

2018    14821
2017    12420
2012     4374
2014     3585
2015     3233
2013     3036
2011     2817
2016     2444
2010     1965
2009      938
2019      360
2008        7
Name: CUSTOMER_SINCE, dtype: int64

In [32]:
test['PAST_PURCHASE'].value_counts()
#it is also a clean coumn

40222    23
4841     13
6874     13
9022     13
6359     13
         ..
12873     1
25187     1
21093     1
16999     1
2047      1
Name: PAST_PURCHASE, Length: 19490, dtype: int64

In [36]:
test.head()
#this train dataframe is fully cleaned now

,ID,STATE,AGE,INCOME_GROUP,CUSTOMER_SINCE,LOYALTY_PROGRAM,PAST_PURCHASE
0,150001,Maharashtra,50,3,2018,0,12746
1,150002,Maharashtra,58,1,2011,1,12277
2,150003,Andaman and Nicobar Islands,30,2,2017,1,16401
3,150004,Mizoram,27,2,2018,1,9665
4,150005,Uttar Pradesh,67,3,2014,0,15724

In [61]:
#part-2 (prediction using logistic regression)
from sklearn import preprocessing, svm
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
#here X and y are used for training and x_test for testing(prediction)
X = train[['AGE','INCOME_GROUP','CUSTOMER_SINCE','LOYALTY_PROGRAM','PAST_PURCHASE']]
y = train[['PURCHASE']]
X_test = test[['AGE','INCOME_GROUP','CUSTOMER_SINCE','LOYALTY_PROGRAM','PAST_PURCHASE']]

In [62]:
#as the column's features are highly varying, so let's use standard scaler as it will bring the uniformity in dataframe
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X)

X = scaler.transform(X)
X_test = scaler.transform(X_test)

In [63]:
#model building
regr = LogisticRegression()
#model fitting  
regr.fit(X, y)
print(regr.score(X, y))

E:\anaconda\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

0.7566933333333333

In [39]:
#prediction
y_pred = regr.predict(X_test)

In [49]:
y_pred.shape

(50000,)

In [65]:
#converting this array into dataframe
y_pred=np.reshape(y_pred,(len(y_pred),1))
submission=pd.DataFrame(y_pred)

In [68]:
#appending it to submission file
sub=pd.read_csv('submission.csv')
sub['prdiction']=submission
sub.to_csv('submission.csv',index=False)

In [79]:
#for f1 score, y_test is not given so let's make prediction on x_train(here x and as output we get y-pred)and compare it with y_train
y_pred_f1 = regr.predict(X)
from sklearn.metrics import f1_score
f1_score(y, y_pred_f1, average='micro')

0.7566933333333333